Revit 2027 API
ParameterTypeId.WallStructureIdParam Property
 "Structure"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId WallStructureIdParam { get; }
Public Shared ReadOnly Property WallStructureIdParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ WallStructureIdParam {
	ForgeTypeId^ get ();
}
static member WallStructureIdParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace